Тестовая_база_ERP_14/src/Documents/УведомлениеОПрекращенииОтпускаПоУходуЗаРебенком/УведомлениеОПрекращенииОтпускаПоУходуЗаРебенком.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УведомлениеОПрекращенииОтпускаПоУходуЗаРебенком</name>
  <attributes>
    <name>ДатаПрекращенияОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриказа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.ДокументыОснованияУведомленияОПрекращенииОтпускаПоУходуЗаРебенком</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПриказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПриказа</name>
    <type>
      <types>EnumRef.СостоянияСотрудника</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПрекращаемыеЗаявления</name>
    <attributes>
      <name>Заявление</name>
      <type>
        <types>DocumentRef.ЗаявлениеСотрудникаНаВыплатуПособия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФиксацияИзменений</name>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Путь</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тестовая_база_ERP_14/src/CommonModules/ПрямыеВыплатыПособийСоциальногоСтрахованияКлиент/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Процедура ОткрытьЗаявлениеСотрудникаПоОснованию(Основание, ИдентификаторСтроки = Неопределено, Заявление = Неопределено) Экспорт
	Если ЗначениеЗаполнено(Заявление) Тогда
		Параметры = Новый Структура("Ключ", Заявление);
		Уникальность = Строка(Заявление.УникальныйИдентификатор());
	ИначеЕсли ЗначениеЗаполнено(Основание) Тогда
		Параметры = Новый Структура("Основание, ИдентификаторСтроки", Основание, ИдентификаторСтроки);
		Уникальность = Строка(Основание.УникальныйИдентификатор());
		Если ИдентификаторСтроки <> Неопределено Тогда
			Уникальность = Уникальность +"/"+ Строка(ИдентификаторСтроки);
		КонецЕсли;
	Иначе
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Документ.ЗаявлениеСотрудникаНаВыплатуПособия.ФормаОбъекта", Параметры, , Уникальность);
КонецПроцедуры

Процедура ОткрытьУведомлениеОПрекращенииПособия(Основание) Экспорт
	Если ЗначениеЗаполнено(Основание) Тогда
		Параметры = Новый Структура("Основание", Основание);
		Уникальность = Строка(Основание.УникальныйИдентификатор());
	Иначе
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Документ.УведомлениеОПрекращенииОтпускаПоУходуЗаРебенком.ФормаОбъекта", Параметры, , Уникальность);
КонецПроцедуры

#КонецОбласти
